#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПоОбъектуОснованию(ОбъектОснование) Экспорт
	ТипОбъектОснование = ТипЗнч(ОбъектОснование);
	
	//Если ТипОбъектОснование = Тип("ДокументСсылка.ЗаявкаНаОплату") Тогда
	//	ЗаполнитьПоДокументуЗаявкаНаОплату(ДокОснование);
	//Иначе
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Заполнение по объекту ""%1"" невозможно. Обратитесь к администратору'"),
			Строка(ОбъектОснование));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения); 
	//КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПроведениеСерверПТБ.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСерверПТБ.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ЭтотОбъект.ОтменаСКонтролем Тогда
		ПроведениеСерверПТБ.ОбработкаУдаленияПроведенияСКонтролем(ЭтотОбъект, Отказ);
	Иначе 
		ПроведениеСерверПТБ.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// Заполнение "по умолчанию"
	Если ЭтотОбъект.Ссылка.Пустая() Тогда
		ЭтотОбъект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Заполнение на основании или по данным переданной структуры
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ЗаполнитьПоОбъектуОснованию(ДанныеЗаполнения);
	Иначе
		Если ТипДанныхЗаполнения = Тип("Структура") Тогда
			ОбщегоНазначенияПТБ.ЗаполнитьПоСтруктуре(ЭтотОбъект, ДанныеЗаполнения);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли 