
#Область ОбработчикиСобытийФормы

Процедура ПриОткрытии(Форма, Отказ) Экспорт
КонецПроцедуры

Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

Процедура ПоказательПриИзменении(Форма, Элемент) Экспорт
КонецПроцедуры

Процедура ПоказательНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
КонецПроцедуры

Процедура ПоказательОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
КонецПроцедуры

Процедура ПоказательОчистка(Форма, Элемент, СтандартнаяОбработка) Экспорт
КонецПроцедуры

#КонецОбласти

