
#Область ОбработчикиСобытийФормы

// Обработка события "ПриОткрытии" из формы редактирования формулы
// см. Обработки.РаботаСФормулами.ФормаОбработки
//
// Все параметры, кроме описанных, стандарты для события
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма обработки
//
Процедура ПриОткрытии(Форма, Отказ) Экспорт
КонецПроцедуры

// Обработка события "ОбработкаОповещения" из формы редактирования формулы
// см. Обработки.РаботаСФормулами.ФормаОбработки
//
// Все параметры, кроме описанных, стандарты для события
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма обработки
//
Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработка события "ПриИзменении" поля "Показатель" формы редактирования формулы
// см. Обработки.РаботаСФормулами.ФормаОбработки
//
// Все параметры, кроме описанных, стандарты для события
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма обработки
//
Процедура ПоказательПриИзменении(Форма, Элемент) Экспорт
КонецПроцедуры

// Обработка события "НачалоВыбора" поля "Показатель" формы редактирования формулы
// см. Обработки.РаботаСФормулами.ФормаОбработки
//
// Все параметры, кроме описанных, стандарты для события
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма обработки
//
Процедура ПоказательНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
КонецПроцедуры

// Обработка события "ОбработкаВыбора" поля "Показатель" формы редактирования формулы
// см. Обработки.РаботаСФормулами.ФормаОбработки
//
// Все параметры, кроме описанных, стандарты для события
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма обработки
//
Процедура ПоказательОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
КонецПроцедуры

// Обработка события "Очистка" поля "Показатель" формы редактирования формулы
// см. Обработки.РаботаСФормулами.ФормаОбработки
//
// Все параметры, кроме описанных, стандарты для события
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма обработки
//
Процедура ПоказательОчистка(Форма, Элемент, СтандартнаяОбработка) Экспорт
КонецПроцедуры

#КонецОбласти

