
#Область ПрограммныйИнтерфейс

// Разбирает строку с параметрами вида Имя1=Значение1<&Имя2=Значение2&...>
// в структуру с именами и значениями параметров
//
// Параметры
//	СтрокаКоманды - Тип: Строка.
//
// Возвращаемое значение
//	Структура
//		Ключ - Строка. Имя параметра
//		Значение - Строка. Значение параметра
//
Функция ПолучитьПараметрыКоманды(СтрокаКоманды) Экспорт
	СтруктураПараметров = Новый Структура;
	
	ДанныеПараметров = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаКоманды, "&");
	Для Каждого Параметр Из ДанныеПараметров Цикл
		ДанныеПараметра = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Параметр, "=");
		Если ДанныеПараметра.Количество() > 1 Тогда
			СтруктураПараметров.Вставить(ДанныеПараметра[0], ДанныеПараметра[1]);
		ИначеЕсли ДанныеПараметра.Количество() = 1 Тогда
			СтруктураПараметров.Вставить(ДанныеПараметра[0], "");
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураПараметров;
КонецФункции

// Выводит сообщение об ошибке. При необходимости вызывает исключение
//
// Параметры:
//	Текст				- Строка - текст сообщения
//	ВызыватьИсключение	- Булево - признак использования исключения
//	НеСообщать			- Булево - не выводит сообщение
// 
Процедура ОбработатьТекстОшибки(знач Текст, знач ВызыватьИсключение, знач НеСообщать) Экспорт
	Если НЕ НеСообщать = Истина Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
	КонецЕсли;
	
	Если ВызыватьИсключение Тогда
		ВызватьИсключение Текст;
	КонецЕсли;
КонецПроцедуры

// Выводит сообщение об ошибке HTTP запроса
//
// Параметры:
//	ОтветHTTP			- ОтветHTTP
//	ВызыватьИсключение	- Булево - признак использования исключения
//	НеСообщать			- Булево - не выводит сообщение
// 
Процедура ОбработатьОшибкуЗапроса(знач ОтветHTTP, знач ВызыватьИсключение = Ложь, знач НеСообщать = Ложь) Экспорт
	ТекстСообщения = СтрШаблон(НСтр("ru='Произошла ошибка при подключении к сервису (код ошибки: %1).'"),
		Строка(ОтветHTTP.КодСостояния));
		
	ОбработатьТекстОшибки(ТекстСообщения, ВызыватьИсключение, НеСообщать);
КонецПроцедуры

#КонецОбласти
