
#Область ПрограммныйИнтерфейс

// Обработка параметров

// Разбирает строку с параметрами вида Имя1=Значение1<&Имя2=Значение2&...>
// в структуру с именами и значениями параметров
//
// Параметры
//	СтрокаКоманды - Тип: Строка.
//
// Возвращаемое значение
//	Структура
//		Ключ - Строка. Имя параметра
//		Значение - Строка. Значение параметра
//
Функция ПолучитьПараметрыКоманды(СтрокаКоманды) Экспорт
	СтруктураПараметров = Новый Структура;
	
	ДанныеПараметров = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаКоманды, "&");
	Для Каждого Параметр Из ДанныеПараметров Цикл
		ДанныеПараметра = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Параметр, "=");
		Если ДанныеПараметра.Количество() > 1 Тогда
			СтруктураПараметров.Вставить(ДанныеПараметра[0], ДанныеПараметра[1]);
		ИначеЕсли ДанныеПараметра.Количество() = 1 Тогда
			СтруктураПараметров.Вставить(ДанныеПараметра[0], "");
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураПараметров;
КонецФункции

#КонецОбласти
