
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПолноеИмяОбъекта = ПолучитьИмяОбъектаМетаданныхНаСервере(ПараметрКоманды);
	
	МассивПунктов = ПолучитьМассивПунктовНаСервере(ПолноеИмяОбъекта);
	
	Если МассивПунктов.Количество() = 0 Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("ПараметрыВыполненияКоманды, ПолноеИмяОбъекта", ПараметрыВыполненияКоманды, ПолноеИмяОбъекта)), "Описания изменений не найдены",30);
        Возврат;
	КонецЕсли;
	
	ОбработкаКомандыФрагмент(ПараметрыВыполненияКоманды, ПолноеИмяОбъекта);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(ДополнительныеПараметры) Экспорт
	
	ПараметрыВыполненияКоманды = ДополнительныеПараметры.ПараметрыВыполненияКоманды;
	ПолноеИмяОбъекта = ДополнительныеПараметры.ПолноеИмяОбъекта;
	
	ОбработкаКомандыФрагмент(ПараметрыВыполненияКоманды, ПолноеИмяОбъекта);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыФрагмент(Знач ПараметрыВыполненияКоманды, Знач ПолноеИмяОбъекта)
	
	Перем ПараметрыФормы;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ПолноеИмяОбъекта", ПолноеИмяОбъекта);
	
	ОткрытьФорму("РегистрСведений.СостоянияПросмотраОписаний.Форма.ФормаПросмотраИзменений", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры

&НаСервере
Функция ПолучитьИмяОбъектаМетаданныхНаСервере(объектссылка)
	
	ИмяКонфигурации = Метаданные.Имя;	
	
	ОбъектМетаданных = ОбъектСсылка.метаданные();	
	ИмяТипаОбъекта = ОбщегоНазначения.ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных);	
	
	ИмяОбъекта = ОбъектМетаданных.Имя;
	ПолноеИмяОбъекта = Строка("["+ИмяКонфигурации+"]["+ИмяТипаОбъекта+"]["+ ИмяОбъекта+"]");
	
	Возврат ПолноеИмяОбъекта;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивПунктовНаСервере(ПолноеИмяОбъекта)
	
	Возврат РегистрыСведений.СообщенияВТехническуюПоддержку.ПолучитьСписокПунктовОбъектаНаСервере(ПолноеИмяОбъекта);
	
КонецФункции
