
&НаКлиенте
Процедура ТестЗаполнитьОтборКомпоновкиДанныхПоИсточнику(Команда)
	
	Компоновщик = ИнициализацияКомпоновщикаНаСервере(ЭтотОбъект.УникальныйИдентификатор);
	
	К2	= ИнициализацияКомпоновщикаНаСервере(ЭтотОбъект.УникальныйИдентификатор);
	Стр	= Новый Структура;
	
	Группа1 = К2.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	Группа1.ТипГруппы	= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	Элемент1 = Группа1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент1.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Ноль");
	Элемент1.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Элемент1.ПравоеЗначение	= 0;
	
	ОтборКомпоновки = Новый ОтборКомпоновкиДанных;
	Элемент2 = ОтборКомпоновки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент2.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Ноль");
	Элемент2.ВидСравнения	= ВидСравненияКомпоновкиДанных.НеРавно;
	Элемент2.ПравоеЗначение	= 0;
	
	ЗначенияДва = Новый Массив;
	ЗначенияДва.Добавить(1);
	ЗначенияДва.Добавить(2);
	ЗначенияДва.Добавить(3);
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(1); 
	
	Стр.Вставить("Один"		, 1);
	Стр.Вставить("Два"		, ЗначенияДва);
	Стр.Вставить("Три"		, Новый ФиксированныйМассив(ЗначенияДва));
	Стр.Вставить("Четыре"	, СписокЗначений);
	
	ОбщегоНазначенияПТБКлиентСервер.ЗаполнитьОтборКомпоновкиДанныхПоИсточнику(Компоновщик, К2);
	ОбщегоНазначенияПТБКлиентСервер.ЗаполнитьОтборКомпоновкиДанныхПоИсточнику(Компоновщик, ОтборКомпоновки);
	ОбщегоНазначенияПТБКлиентСервер.ЗаполнитьОтборКомпоновкиДанныхПоИсточнику(Компоновщик, Стр);
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ИнициализацияКомпоновщикаНаСервере(знач УникальныйИдентификатор)
	СхемаКомпоновкиДанных = Обработки.ТестОбщегоНазначенияПТБКлиентСервер.ПолучитьМакет("СКД");
	
	Настройки	= СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	URLСхемы	= ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(ИсточникНастроек);
	Компоновщик.ЗагрузитьНастройки(Настройки);
	
	Возврат Компоновщик;
КонецФункции
