
#Область ПрограммныйИнтерфейс

Функция ВыполнитьРасчетФормулРекурсивно(знач Настройки, знач МассивКлючей) Экспорт
	ПараметрыАлгоритма = Новый Структура;
	ПараметрыАлгоритма.Вставить("Результат"		, Неопределено);
	ПараметрыАлгоритма.Вставить("Настройки"		, Настройки);
	ПараметрыАлгоритма.Вставить("МассивКлючей"	, МассивКлючей);
	
	ТекстАлгоритма = "Параметры.Результат = РаботаСФормуламиКлиентСервер.ВыполнитьРасчетФормулРекурсивно(
		|Параметры.Настройки,
		|Параметры.МассивКлючей);";
	
	ОбщегоНазначения.ВыполнитьВБезопасномРежиме(ТекстАлгоритма, ПараметрыАлгоритма);
	
	Возврат ПараметрыАлгоритма.Результат;
КонецФункции

#КонецОбласти