// Copyright (c) 2023, ООО ПрогТехБизнес
// Лицензия Attribution 4.0 International (CC BY 4.0)

#Область ПрограммныйИнтерфейс

// Вызывается перед заполнением показателей в форму редактирования формулы
//
// Параметры:
//	Форма		- ФормаКлиентскогоПриложения
//	Показатели	- Структура - см. РаботаСФормуламиКлиентСервер.ДобавитьГруппуПоказателей
//
Процедура ПередЗаполнениемПоказателей(Форма, Показатели) Экспорт
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Обработка события "ПриСозданииНаСервере" из формы редактирования формулы
// см. Обработки.РаботаСФормулами.ФормаОбработки
//
// Все параметры, кроме описанных, стандарты для события
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма обработки
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
КонецПроцедуры

// Обработка события "ОбработкаПроверкиЗаполненияНаСервере" из формы редактирования формулы
// см. Обработки.РаботаСФормулами.ФормаОбработки
//
// Все параметры, кроме описанных, стандарты для события
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма обработки
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт
КонецПроцедуры

#КонецОбласти
