// Copyright (c) 2023, ООО ПрогТехБизнес
// Лицензия Attribution 4.0 International (CC BY 4.0)

#Область ПрограммныйИнтерфейс
 
// см. ИнтеграцияConfluence.НастройкиПодключения
Функция НастройкиПодключения(знач БазаЗнанийСсылка, знач ПользовательСсылка = Неопределено) Экспорт
	Возврат ИнтеграцияConfluence.НастройкиПодключения(БазаЗнанийСсылка, ПользовательСсылка);
КонецФункции
 
// см. ИнтеграцияConfluence.НастройкиПодключенияПоЛогину
Функция НастройкиПодключенияПоЛогину(знач БазаЗнанийСсылка, знач Логин, знач ТокенID) Экспорт
	Возврат ИнтеграцияConfluence.НастройкиПодключенияПоЛогину(БазаЗнанийСсылка, Логин, ТокенID);
КонецФункции

#КонецОбласти
 
