
&НаКлиенте
Процедура УникальныйИдентификаторВызовСервера(Команда)
	
    Результат = Строка(Объект.Ссылка.УникальныйИдентификатор());
	ОбщегоНазначенияКлиент.СообщитьПользователю(Результат);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ТестНомерКартинкиПоТипуДанных(Команда)
	Список = Новый СписокЗначений;
	Список.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Клиент'"));
	Список.Добавить(КодВозвратаДиалога.Нет, НСтр("ru='Сервер'"));
	Список.Добавить(КодВозвратаДиалога.Отмена);
	
	Ответ = Ждать ВопросАсинх(НСтр("ru='Укажите директиву выполнения метода'"),
		Список, 60, КодВозвратаДиалога.Да,, КодВозвратаДиалога.Отмена);
		
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ТестНомерКартинкиПоТипуДанныхКлиентСервер(ЭтотОбъект);
	Иначе 
		ТестНомерКартинкиПоТипуДанныхНаСервере();
	КонецЕсли;
КонецПроцедуры

#Область ТестНомерКартинкиПоТипуДанных

&НаСервере 
Процедура ТестНомерКартинкиПоТипуДанныхНаСервере()
	ТестНомерКартинкиПоТипуДанныхКлиентСервер(ЭтотОбъект);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура ТестНомерКартинкиПоТипуДанныхКлиентСервер(Форма)
	СообщитьТестНомерКартинки("Булево", 0);
	СообщитьТестНомерКартинки("Дата", 2);
	СообщитьТестНомерКартинки("Строка", 8);
	СообщитьТестНомерКартинки("УникальныйИдентификатор", 4);
	СообщитьТестНомерКартинки("Картинка", 17);
	СообщитьТестНомерКартинки("Число", 13);
	СообщитьТестНомерКартинки("Структура,ФиксированнаяСтруктура", 1);
	СообщитьТестНомерКартинки("Соответствие,ФиксированноеСоответствие", 1);
	СообщитьТестНомерКартинки("Массив,ФиксированныйМассив", 9);
	СообщитьТестНомерКартинки("СписокЗначений", 9);
	#Если Клиент Тогда
	    СообщитьТестНомерКартинки("СправочникСсылка.Организации", 18);
	#Иначе
		СообщитьТестНомерКартинки("СправочникСсылка.Организации", 7);
	#КонецЕсли
	СообщитьТестНомерКартинки("Неопределено", 18);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура СообщитьТестНомерКартинки(ЗначениеТип, НомерКартинки)
	Если ТипЗнч(ЗначениеТип) = Тип("Строка") Тогда
		МассивПодстрок = СтрРазделить(ЗначениеТип, ",");
		Если МассивПодстрок.Количество() > 1 Тогда
			Для Каждого ИмяТипа Из МассивПодстрок Цикл
				СообщитьТестНомерКартинки(СокрЛП(ИмяТипа), НомерКартинки);
			КонецЦикла;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеТип) = Тип("Строка") Тогда
		ТипПроверки = Тип(ЗначениеТип);
	Иначе 
		ТипПроверки = ЗначениеТип;
	КонецЕсли;		
	
	#Если Клиент Тогда
		НомерПоТипу	= ОбщегоНазначенияПТБКлиентСервер.НомерКартинкиПоТипуДанных(ТипПроверки);
	#Иначе 
		НомерПоТипу	= ОбщегоНазначенияПТБ.НомерКартинкиПоТипуДанных(ТипПроверки);
	#КонецЕсли
	Результат	= (НомерПоТипу = НомерКартинки);
	
	ТекстСообщения = СтрШаблон(НСтр("ru='Тип: %1. Картинка: %2/%3 - %4'"),
		ТипПроверки,
		Формат(НомерПоТипу, "ЧН=0; ЧГ="),
		Формат(НомерКартинки, "ЧН=0; ЧГ="),
		Результат);
	
	#Если Клиент Тогда
	    ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	#Иначе 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	#КонецЕсли
КонецПроцедуры

#КонецОбласти
