// Copyright (c) 2023, ООО ПрогТехБизнес
// Лицензия Attribution 4.0 International (CC BY 4.0)

// Выполняет преобразование значения в строку JSON для типов, не поддерживаемых подсистемой
//	
// Используется для дополнения в методе ИнтернетСервисыКлиентСервер.ЗначениеВСтрокуJSON
// если метод выполняется на сервере
//
// Параметры:
//	Свойство				- Строка - имя свойства
//	Значение				- Произвольный - значение свойства
//	Параметры				- Структура - см. ИнтернетСервисыКлиентСервер.ПараметрыЗначениеВСтрокуJSON
//	СтандартнаяОбработка	- Булево - признак стандартной обработки в методе ИнтернетСервисы.СериализацияЗначенияВJSON
//
// Возвращаемое значение:
//   Строка, Число, Булево - значение для подстановки в JSON
//
Функция СериализацияЗначенияВJSON(знач Свойство, знач Значение, знач Параметры, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Истина;
	Возврат Неопределено;
	
	//ТипЗначения = ТипЗнч(Значение);
	//
	//Отказ = Истина;
	//
	//ВызватьИсключение СтрШаблон(НСтр("ru='Недопустимый тип (%1) свойства ""%2"" (%3)'"),
	//	Строка(ТипЗначения),
	//	Свойство,
	//	Строка(Значение));
КонецФункции
