
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	КэшНастроек = Новый Соответствие;
	
	Для Каждого ЗаписьРегистра Из ЭтотОбъект Цикл
		ПараметрыНастройки = КэшНастроек.Получить(ЗаписьРегистра.Настройка);
		Если ПараметрыНастройки = Неопределено Тогда
			ПараметрыНастройки = Перечисления.ВидыНастроекИнтеграцииSlack.ПолучитьДанныеНастройки(ЗаписьРегистра.Настройка);
			КэшНастроек.Вставить(ЗаписьРегистра.Настройка, ПараметрыНастройки);
		КонецЕсли;
		
		ЗначениеНастройки = ЗаписьРегистра[ЗаписьРегистра.ИмяРесурса];
		Если ЗначениеЗаполнено(ПараметрыНастройки.Формат) Тогда
			ПредставлениеНастройки = Формат(ЗначениеНастройки, ПараметрыНастройки.Формат);
		Иначе 
			ПредставлениеНастройки = СокрЛП(ЗначениеНастройки);
		КонецЕсли; 
			
		ЗаписьРегистра.Представление = ПредставлениеНастройки;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли 