
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПодготовитьПараметрыСериализацииВJSON(Параметры) Экспорт
	Параметры.Вставить("ТипВсеСсылки"		, ОбщегоНазначения.ОписаниеТипаВсеСсылки());
	Параметры.Вставить("ТипПеречисление"	, Перечисления.ТипВсеСсылки());
КонецПроцедуры

// Выполняет сериализацию данных в строку JSON при помощи общего модуля JSON
// Для сериализации штатными методами платформы используется метод ИнтернетСервисыКлиентСервер.ЗначениеВСтрокуJSON
//
// Параметры:
//	ОбъектДанных - ЛюбоеЗначение - объект для сериализации данных
//
// Возвращаемое значение:
//   Строка
// 
Функция ПолучитьСтрокуJSON(знач ОбъектДанных) Экспорт
	Возврат JSON.Записать(ОбъектДанных); 
КонецФункции

Функция ПодготовитьЗначениеТип(знач Значение) Экспорт
	Возврат ОбщегоНазначения.СтроковоеПредставлениеТипа(Значение);
КонецФункции

Функция ПодготовитьЗначениеОписаниеТипов(знач Значение) Экспорт
	МассивТипов = Новый Массив;
	Для Каждого Тип Из Значение.Типы() Цикл
		МассивТипов.Добавить(ОбщегоНазначения.СтроковоеПредставлениеТипа(Тип));
	КонецЦикла;
	
	Возврат МассивТипов;
КонецФункции

Функция ПодготовитьЗначениеПеречисление(знач Значение) Экспорт
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		ИмяЗначения = "ПустаяСсылка";
	Иначе 
		ИмяЗначения = ОбщегоНазначения.ИмяЗначенияПеречисления(Значение);
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ИмяТаблицыПоСсылке(Значение) + "." + ИмяЗначения;
КонецФункции

#КонецОбласти
