
#Область УправлениеФормой

&НаСервере 
Процедура ИнициализацияФормы()
	
	#Область Групповое_редактирование_строк_ТЧ
	
	Настройки = ГрупповоеРедактированиеТабличныхЧастейСервер.НастройкиИнициализации();
	
	Настройки.ДоступныеТаблицы		= СтрРазделить("ТаблицаОбъекта,Дерево6,СписокЗначений,ДеревоКопия",",");
	Настройки.ДоступныеКолонки		= СтрРазделить("ТаблицаОбъектаРеквизитОсновной,ТРеквизит1,ТаблицаОбъектаГруппа1,Дерево6Группа2,Дерево1",",");
	Настройки.НедоступныеКолонки	= СтрРазделить("ТРеквизит1,Цена",",");   

	Настройки.НастройкиРазмещения.Вставить("ТаблицаОбъекта"	, "Группа2");
	Настройки.НастройкиРазмещения.Вставить("Дерево6"		, "Дерево6Группа1");
	Настройки.НастройкиРазмещения.Вставить("СписокЗначений"	, "Группа4");

	ГрупповоеРедактированиеТабличныхЧастейСервер.СформироватьОписаниеТабличныхЧастейФормы(ЭтотОбъект, Настройки);
	
	НастройкиСуммирования = ГрупповоеРедактированиеТабличныхЧастейСервер.НастройкиИнициализацииСуммыВыделенныхСтрок();
	НастройкиСуммирования.ДоступныеТаблицы = СтрРазделить("ТаблицаОбъекта,Дерево6,СписокЗначений",",");

	НастройкиСуммирования.НастройкиРазмещения.Вставить("ТаблицаОбъекта"	, "Группа2");
	НастройкиСуммирования.НастройкиРазмещения.Вставить("Дерево6"		, "Группа3");
	НастройкиСуммирования.НастройкиРазмещения.Вставить("СписокЗначений"	, "Группа4");

	ГрупповоеРедактированиеТабличныхЧастейСервер.ОписаниеТабличныхЧастейДляСуммированияСтрок(ЭтотОбъект, НастройкиСуммирования);

	#КонецОбласти 

	ЗаполнитьТаблицыПроизвольнымиДанными();	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТаблицаОбъектаРеквизитОсновной", "ТолькоПросмотр", Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы  

&НаКлиенте
Процедура ДеревоСтрокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	#Область Групповое_редактирование_строк_ТЧ
	ГрупповоеРедактированиеТабличныхЧастейКлиент.ОбработкаВыбораТабличнойЧасти(ЭтотОбъект, ВыбранноеЗначение, СтандартнаяОбработка);
	#КонецОбласти 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	#Область Групповое_редактирование_строк_ТЧ
	ГрупповоеРедактированиеТабличныхЧастейКлиент.ОбработкаВыбораТабличнойЧасти(ЭтотОбъект, ВыбранноеЗначение, СтандартнаяОбработка);
	#КонецОбласти 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбъектаПриАктивизацииЯчейки(Элемент)
	ЭтотОбъект.ПодключитьОбработчикОжидания("Подключаемый_РасчетСуммыВыделенныхСтрок", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийПриАктивизацииЯчейки(Элемент)
	ЭтотОбъект.ПодключитьОбработчикОжидания("Подключаемый_РасчетСуммыВыделенныхСтрок", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	#Область Групповое_редактирование_строк_ТЧ
	ГрупповоеРедактированиеТабличныхЧастейКлиент.ОбработкаВыбораТабличнойЧасти(ЭтотОбъект, ВыбранноеЗначение, СтандартнаяОбработка);
	#КонецОбласти 

КонецПроцедуры

&НаКлиенте
Процедура ДеревоПриАктивизацииЯчейки(Элемент)
	ЭтотОбъект.ПодключитьОбработчикОжидания("Подключаемый_РасчетСуммыВыделенныхСтрок", 0.2, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ИнициализацияФормы();
	КонецЕсли;
	
КонецПроцедуры        
		
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИнициализацияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьСправочникиДляТеста(Команда)
	ЗаполнитьСправочникиДляТестаНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ЗавершениеНемодальныхВызовов
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции_ТестируемыеДанные

&НаСервереБезКонтекста
Процедура ЗаполнитьСправочникиДляТестаНаСервере()
	
	Генератор = Новый ГенераторСлучайныхЧисел;

	КоличествоСтрок = 5;

	Массив = Новый Массив;
	Массив.Добавить("ТестГрупповоеРедактированиеТЧОсновной");
	Массив.Добавить("ТестГрупповоеРедактированиеТЧОсновнойВладелец");
	Массив.Добавить("ТестГрупповоеРедактированиеТЧПодчиненный");
	
	СтруктураСозданных = Новый Структура;
	Для Каждого ИмяСправочника Из Массив Цикл
		
		МассивСозданных = Новый Массив;
		
		Менеджер = Справочники[ИмяСправочника];
		
		Выборка = Менеджер.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивСозданных.Добавить(Выборка.Ссылка);
			СтруктураСозданных.Вставить(ИмяСправочника, МассивСозданных);
		КонецЦикла; 	   
				
		Если МассивСозданных.Количество() <> 0 Тогда
			Продолжить;			
		КонецЕсли;     
		
		Для Индекс = 1 По КоличествоСтрок Цикл
			СозданиеЭлементовСправочника(Менеджер, ИмяСправочника, МассивСозданных, Генератор, Индекс, СтруктураСозданных);		
		КонецЦикла;
		
		СтруктураСозданных.Вставить(ИмяСправочника, МассивСозданных);
	КонецЦикла;        

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СозданиеЭлементовСправочника(Менеджер, ИмяСправочника, МассивСозданных, Генератор, Индекс, СтруктураСозданных)  
	                                                                    
	НовыйЭлемент = Менеджер.СоздатьЭлемент();
	
	ВладелецСсылка = Неопределено;
	
	Если ИмяСправочника = "ТестГрупповоеРедактированиеТЧПодчиненный" Тогда
		Массив = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураСозданных,"ТестГрупповоеРедактированиеТЧОсновнойВладелец", Неопределено);
		Если Массив = Неопределено Тогда
			Возврат;			
		КонецЕсли;
		НовыйЭлемент.Владелец = Массив[Индекс]	
	КонецЕсли;         
		
	СлЧисло = Генератор.СлучайноеЧисло(1,1);
	НовыйЭлемент.Выходной = Цел(СлЧисло/2)=СлЧисло;	      
	НовыйЭлемент.Код 			= Строка(Индекс);
	НовыйЭлемент.Наименование 	= ИмяСправочника + Строка(Индекс);      
    
	НовыйЭлемент.Записать();

	МассивСозданных.Добавить(НовыйЭлемент.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыПроизвольнымиДанными()
	
	Генератор = Новый ГенераторСлучайныхЧисел;
	
	КоличествоСтрок = 5;
	
	Для Индекс = 1 По КоличествоСтрок Цикл
		НоваяСтрока = Объект.ТаблицаОбъекта.Добавить();
		НоваяСтрока.Цена = Генератор.СлучайноеЧисло();		
		НоваяСтрока = ЭтотОбъект.Дерево.ПолучитьЭлементы().Добавить();
		НоваяСтрока.а = Генератор.СлучайноеЧисло();	
		СписокЗначений.Добавить(Генератор.СлучайноеЧисло());
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Групповое_редактирование_строк_ТЧ

&НаКлиенте
Процедура Подключаемый_ГрупповоеРедактированиеСтрок(Команда)
	
	ГрупповоеРедактированиеТабличныхЧастейКлиент.ОткрытьФормуЗаполненияВыделенныхСтрок(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте 
Процедура Подключаемый_ГрупповоеРедактированиеПередИзменениемСтроки(ТекущаяСтрока, ИмяКолонки, ЗначениеДо, ЗначениеПосле, Отказ) Экспорт 
	//УсловиеОтказа = ЗначениеПосле > 100;
	//Если УсловиеОтказа Тогда
	//	Отказ = Истина;		
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработчикиПриГрупповомРедактированииСтроки(Результат, ДопПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ГрупповоеРедактированиеСтрокТаблицы" Тогда 
		ОповещениеПриИзменении = Новый ОписаниеОповещения("Подключаемый_ОбработчикиПриГрупповомРедактированииСтроки", ЭтотОбъект, Параметр);
		ГрупповоеРедактированиеТабличныхЧастейКлиент.ОбработкаОповещения(ЭтотОбъект, Параметр, ОповещениеПриИзменении);	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область Расчет_Суммы_Выделенных_Строк

&НаКлиенте
Процедура Подключаемый_РасчетСуммыВыделенныхСтрок() Экспорт
	ГрупповоеРедактированиеТабличныхЧастейКлиент.РасчетСуммыВыделенныхСтрок(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти
