
&НаСервере 
Процедура ИнициализацияФормы()
	
	#Область Групповое_редактирование_строк_ТЧ
	
	ОтображениеСуммыВыделенныхСтрок = Новый Соответствие; // Соответствие Элементов ТаблицаФормы (для которой вычисляем суммы) и ГруппаФормы(в которой создаем реквизиты расчета) 
	ОтображениеСуммыВыделенныхСтрок.Вставить("ТаблицаОбъекта"	, "Группа2");
	ОтображениеСуммыВыделенныхСтрок.Вставить("Дерево6"			, "Группа2");

	ГрупповоеРедактированиеТабличныхЧастейСервер.СформироватьОписаниеТабличныхЧастейФормы(ЭтаФорма,,,,ОтображениеСуммыВыделенныхСтрок);
	
	#КонецОбласти 

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ИнициализацияФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИнициализацияФормы();
	
КонецПроцедуры

#Область Групповое_редактирование_строк_ТЧ

&НаКлиенте
Процедура Подключаемый_ГрупповоеРедактированиеСтрок(Команда)
	
	ГрупповоеРедактированиеТабличныхЧастейКлиент.ОткрытьФормуЗаполненияВыделенныхСтрок(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработчикиПриГрупповомРедактированииСтрок(Результат, ДопПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте 
Процедура Подключаемый_ГрупповоеРедактированиеПередИзменением(ТекущаяСтрока, ИмяКолонки, ЗначениеДо, ЗначениеПосле, Отказ) Экспорт
	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ДеревоСтрокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	#Область Групповое_редактирование_строк_ТЧ
	ГрупповоеРедактированиеТабличныхЧастейКлиент.ОбработкаВыбораТабличнойЧасти(ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	#КонецОбласти 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	#Область Групповое_редактирование_строк_ТЧ
	ГрупповоеРедактированиеТабличныхЧастейКлиент.ОбработкаВыбораТабличнойЧасти(ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	#КонецОбласти 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбъектаПриАктивизацииЯчейки(Элемент)
	ЭтотОбъект.ПодключитьОбработчикОжидания("Подключаемый_РасчетСуммыВыделенныхСтрок", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасчетСуммыВыделенныхСтрок() Экспорт
	ГрупповоеРедактированиеТабличныхЧастейКлиент.РасчетСуммыВыделенныхСтрок(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПриАктивизацииЯчейки(Элемент)
	ЭтотОбъект.ПодключитьОбработчикОжидания("Подключаемый_РасчетСуммыВыделенныхСтрок", 0.2, Истина);
КонецПроцедуры
