
// Метод предназначен для изменения правил тестирования реквизитов
// Редактирование правил выполняется методом ТестированиеРолейПТБ.ДобавитьНастройкуРеквизита
//
// Например:
//	Для выполнения тестирования настройки ролей по типам реквизита
//		ТестированиеРолейПТБ.ДобавитьНастройкуРеквизита(ПравилаТестирования, "Организация", Метаданные.ОбщиеРеквизиты.Организация.Тип, ПроверкаЗначения.ВыводитьОшибку);
//	Для отключения тестирования настройки ролей
//		ТестированиеРолейПТБ.ДобавитьНастройкуРеквизита(ПравилаТестирования, "Ответственный", Неопределено, ПроверкаЗначения.НеПроверять);		
//
// Рекомендуется размещать логику тестирования в модулях менеджеров объектов конфигурации
// Для этого необходимо в ММ добавить публичный метод ПолучитьПравилаТестированияРолейРеквизитов
// Например:
//	Процедура ПолучитьПравилаТестированияРолейРеквизитов(ПравилаТестирования) Экспорт
//		// здесь размещаются настройки
//	КонецПроцедуры
//
// Параметры:
//	ПравилаТестирования - Соответствие
//		Ключ		- Строка - имя реквизита, имя табличной части, имя реквизита табличной части
//		Значение	- Структура
//			Тип			- ОписаниеТипов
//			Проверка	- ПроверкаЗначений
//	МетаданныеОбъекта	- Метаданные.[Объект]
// 
Процедура ПолучитьПравилаТестированияРолейРеквизитов(ПравилаТестирования, знач МетаданныеОбъекта) Экспорт
	
	// здесь можно дописывать собственную логику реализации проверки
	
КонецПроцедуры

// Метод предназначен для изменения правил тестирования доступа к изменяемым объектам
//
// Рекомендуется размещать логику тестирования в модулях менеджеров объектов конфигурации
// Для этого необходимо в ММ добавить публичный метод ПолучитьПравилаТестированияРолейДвижений
// Например:
//	Процедура ПолучитьПравилаТестированияРолейДвижений(МассивОбъектов) Экспорт
//		// здесь размещаются настройки
//	КонецПроцедуры
//
// Параметры:
//	МассивОбъектов		- Массив - массив полных имен объектов, которые будут проверены на Чтение, Изменение
//	МетаданныеОбъекта	- Метаданные.[Объект]
// 
Процедура ПолучитьПравилаТестированияРолейДвижений(МассивОбъектов, знач МетаданныеОбъекта) Экспорт 
	
	// здесь можно дописывать собственную логику реализации проверки
	
КонецПроцедуры

// Метод предназначен для изменения правил тестирования доступа к изменяемым объектам
//
// Рекомендуется размещать логику тестирования в модулях менеджеров объектов конфигурации
// Для этого необходимо в ММ добавить публичный метод ПолучитьПравилаТестированияРолейМакетовСКД
// Например:
//	Процедура ПолучитьПравилаТестированияРолейМакетовСКД(МассивМакетов) Экспорт
//		// здесь размещаются настройки
//	КонецПроцедуры
//
// Параметры:
//	МассивОбъектов		- Массив - массив имен макетов СКД. Источники данных запросов будут проверены на Чтение
//	МетаданныеОбъекта	- Метаданные.[Объект]
// 
Процедура ПолучитьПравилаТестированияРолейМакетовСКД(МассивМакетов, знач МетаданныеОбъекта) Экспорт 
	
	// здесь можно дописывать собственную логику реализации проверки
	
КонецПроцедуры


