
&НаКлиенте
Процедура РеквизитОбъектаПриИзменении(Элемент)
	Если РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыСравнить(ЭтотОбъект, "Объект." + Элемент.Имя) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Значение не изменилось'"));
		Возврат;
	КонецЕсли;
	
	ЗначениеДо = РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыПолучить(ЭтотОбъект, "Объект." + Элемент.Имя);
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Предыдущее значение: '") + Строка(ЗначениеДо));
	
	РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыОбновитьРеквизиты(ЭтотОбъект, "Объект." + Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитПриИзменении(Элемент)
	НомерЭлемента	= СтрЗаменить(Элемент.Имя, "Реквизит", "");
	ИмяЭлемента		= "Реквизит" + Формат(Число(НомерЭлемента) - 5, "ЧГ=");
	
	Если РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыСравнить(ЭтотОбъект, ИмяЭлемента) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Значение не изменилось'"));
		Возврат;
	КонецЕсли;
	
	ЗначениеДо = РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыПолучить(ЭтотОбъект, ИмяЭлемента);
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Предыдущее значение: '") + Строка(ЗначениеДо));
	
	РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыОбновитьРеквизиты(ЭтотОбъект, "РеквизитыФормы");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквизитыОбъекта = Новый Массив;
	Для Каждого МетаРеквизит Из Метаданные.Обработки.ТестКопияДанныхФормы.Реквизиты Цикл
		РеквизитыОбъекта.Добавить("Объект." + МетаРеквизит.Имя);
	КонецЦикла;
	
	РаботаСФормамиПТБ.КопияДанныхФормыИнициализация(ЭтотОбъект, РеквизитыОбъекта);
	
	РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыОбновить(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРеквизитыФормы(Команда)
	
	Массив = СтрРазделить("Реквизит1,Реквизит2,Реквизит3,Реквизит4,Реквизит5", ",");
	РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыДобавитьРеквизиты(ЭтотОбъект, Массив, "РеквизитыФормы");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсе(Команда)
	
	РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыОбновить(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФормуПоОбъекту(Команда)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЭтотОбъект.Объект);
	РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыОбновитьРеквизиты(ЭтотОбъект, "РеквизитыФормы");
КонецПроцедуры
