						
#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТабличнаяЧасть
						
&НаКлиенте
Процедура ТабличнаяЧастьПередУдалением(Элемент, Отказ)

	ПараметрыУдалить = РаботаСФормамиПТБКлиент.ПараметрыПодтвержденияУдаленияСтрок();
	ПараметрыУдалить.Текст				= НСтр("ru='дополнительный текст'");
	ПараметрыУдалить.ОповещениеДо		= Новый ОписаниеОповещения("ТабличнаяЧастьПередУдалениемОповещениеДо", ЭтотОбъект);
	ПараметрыУдалить.ОповещениеПосле	= Новый ОписаниеОповещения("ТабличнаяЧастьПередУдалениемОповещениеПосле", ЭтотОбъект);
	ПараметрыУдалить.ОповещениеОтказ	= Новый ОписаниеОповещения("ТабличнаяЧастьПередУдалениемОповещениеОтказ", ЭтотОбъект);
	ПараметрыУдалить.КнопкаПоУмолчанию	= КодВозвратаДиалога.ОК;
	
    РаботаСФормамиПТБКлиент.ПодтвердитьУдалениеСтрок(ЭтотОбъект,
		Объект.ТабличнаяЧасть,
		Элемент,
		Отказ,
		ПараметрыУдалить);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
КонецПроцедуры

#КонецОбласти

#Область ЗавершениеНемодальныхВызовов

&НаКлиенте
Процедура ТабличнаяЧастьПередУдалениемОповещениеДо(Идентификаторы, ДопПараметры) Экспорт
	
	ТекстСообщения = СтрШаблон(НСтр("ru='%1(%2,%3)'"),
		"ТабличнаяЧастьПередУдалениемОповещениеДо",
		Строка(Идентификаторы),
		Строка(ДопПараметры));
		
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПередУдалениемОповещениеПосле(Результат, ДопПараметры) Экспорт
	
	ТекстСообщения = СтрШаблон(НСтр("ru='%1(%2,%3)'"),
		"ТабличнаяЧастьПередУдалениемОповещениеПосле",
		Строка(Результат),
		Строка(ДопПараметры));
		
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПередУдалениемОповещениеОтказ(Идентификаторы, ДопПараметры) Экспорт
	
	ТекстСообщения = СтрШаблон(НСтр("ru='%1(%2,%3)'"),
		"ТабличнаяЧастьПередУдалениемОповещениеОтказ",
		Строка(Идентификаторы),
		Строка(ДопПараметры));
		
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти
