
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПараметрКоманды", ПараметрКоманды);
	ДопПараметры.Вставить("ПараметрыВыполненияКоманды", ПараметрыВыполненияКоманды);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПользователюЗавершение", ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Поиск выполняется на сайте базы знаний ПТБ.
	|Будет открыто окно браузера.'"), РежимДиалогаВопрос.ОКОтмена, 60, КодВозвратаДиалога.ОК,, КодВозвратаДиалога.Отмена);
КонецПроцедуры

&НаКлиенте
Процедура ВопросПользователюЗавершение(РезультатВопроса, ПараметрыВыполнения) Экспорт
	Если НЕ РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрКоманды = ПараметрыВыполнения.ПараметрКоманды;
	ПараметрыВыполненияКоманды = ПараметрыВыполнения.ПараметрыВыполненияКоманды;
	
	ОбластьПоискаОбъекта = "umtrvnzm";
	ПредставлениеОбъекта = ПолучитьПредставлениеОбъектаДляПоискаНаСервере(ПараметрКоманды);
	
	СтрокаПоиска = "https://progtb.atlassian.net/wiki/dosearchsite.action?cql=siteSearch+~+%22_СтрокаПоиска_%22+and+space+%3D+%22_ОбластьПоиска_%22&queryString=_СтрокаПоиска_";
	СтрокаПоиска = СтрЗаменить(СтрокаПоиска, "_СтрокаПоиска_", ПредставлениеОбъекта);
	СтрокаПоиска = СтрЗаменить(СтрокаПоиска, "_ОбластьПоиска_", ОбластьПоискаОбъекта);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗапускПриложенияЗавершение", ЭтотОбъект);
	НачатьЗапускПриложения(ОписаниеОповещения, СтрокаПоиска);
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПриложенияЗавершение(Результат, ДопПараметры) Экспорт	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПредставлениеОбъектаДляПоискаНаСервере(ОбъектСсылка)
	ОбъектМетаданных = ОбъектСсылка.Метаданные();	
	ПредставлениеОбъекта = ОбъектМетаданных.Представление();
	
	Возврат КодироватьСтроку(СтрЗаменить(ПредставлениеОбъекта, " ", "+"), СпособКодированияСтроки.КодировкаURL);
КонецФункции

