
Функция ИмяРеквизитаНастроекГрупповогоРедактирования() Экспорт

	Возврат "_Служебный_ОписаниеТаблицДляГрупповогоРедактирования_";
	
КонецФункции

Функция ИмяРеквизитаНастроекСуммирования() Экспорт

	Возврат "_Служебный_ОписаниеТаблицДляСуммированияСтрок_";
	
КонецФункции

Функция ИмяРеквизитаСуммыВыделенныхСтрок(знач ИмяТаблицы) Экспорт

	Возврат ИмяТаблицы + "_РасчетСуммыСтрок_";
	
КонецФункции

Функция ПолучитьКоллекциюДанныхФормыПоПутиКДанным(Форма, ТаблицаПутьКДанным) Экспорт
	
	Если СтрЧислоВхождений(ТаблицаПутьКДанным,".") = 0 Тогда
	 	КоллекцияДанныхФормы = Форма[ТаблицаПутьКДанным];
	ИначеЕсли СтрЧислоВхождений(ТаблицаПутьКДанным,".") = 1 Тогда  	// Если ПутьКДанным = "Объект.ТаблицаОбъекта"
		Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТаблицаПутьКДанным, ".");
	 	КоллекцияДанныхФормы = Форма[Массив[0]][Массив[1]];                                                      
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
	Возврат КоллекцияДанныхФормы;
	
КонецФункции

Функция ЭтоДопустимаяКоллекцияДанныхФормы(знач КоллекцияДанныхФормы) Экспорт
	
	Возврат ТипЗнч(КоллекцияДанныхФормы) = Тип("ДанныеФормыКоллекция") 
		ИЛИ ТипЗнч(КоллекцияДанныхФормы) = Тип("ДанныеФормыДерево");
		//ИЛИ ТипЗнч(КоллекцияДанныхФормы) = Тип("СписокЗначений");
		
КонецФункции
