
#Область ПрограммныйИнтерфейс
 
// Выполняет поиск среди открытых окон по полному имени формы
//
// Параметры:
//	ИмяФормы - Строка - полное имя формы
//
// Возвращаемое значение:
//   ФормаКлиентскогоПриложения, Неопределено
// 
Функция НайтиОткрытуюФормуПоИмени(знач ИмяФормы) Экспорт
	МассивОкон = ПолучитьОкна();
	Для Каждого ОкноПриложения Из МассивОкон Цикл
		Для Каждого ФормаПриложения Из ОкноПриложения.Содержимое Цикл
			Если НЕ ТипЗнч(ФормаПриложения) = Тип("ФормаКлиентскогоПриложения") Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ФормаПриложения.ИмяФормы = ИмяФормы Тогда
				Продолжить;
			КонецЕсли;
			
			Возврат ФормаПриложения;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти
