// Copyright (c) 2023, ООО ПрогТехБизнес
// Лицензия Attribution 4.0 International (CC BY 4.0)

#Область ПрограммныйИнтерфейс

Функция ПолучитьМассивМетаданных() Экспорт
	Массив = Новый Массив;
	
	Массив.Добавить("Метаданные");
	Массив.Добавить("Подсистемы");
	Массив.Добавить("ПараметрыСеанса");
	Массив.Добавить("ОбщиеРеквизиты");
	Массив.Добавить("ПланыОбмена");
	Массив.Добавить("КритерииОтбора");
	Массив.Добавить("ОбщиеФормы");
	Массив.Добавить("ОбщиеКоманды");
	Массив.Добавить("Константы");
	Массив.Добавить("Справочники");
	Массив.Добавить("Документы");
	Массив.Добавить("ЖурналыДокументов");
	Массив.Добавить("Отчеты");
	Массив.Добавить("Обработки");
	Массив.Добавить("ПланыВидовХарактеристик");
	Массив.Добавить("ПланыСчетов");
	Массив.Добавить("ПланыВидовРасчета");
	Массив.Добавить("РегистрыСведений");
	Массив.Добавить("РегистрыНакопления");
	Массив.Добавить("РегистрыБухгалтерии");
	Массив.Добавить("РегистрыРасчета");
	Массив.Добавить("БизнесПроцессы");
	Массив.Добавить("Задачи");
	Массив.Добавить("ВнешниеИсточникиДанных");
	
	Возврат Массив;
КонецФункции

Функция ПолучитьПраваДляОпроса(знач ИмяВидаОбъекта, знач Платформа8_3 = Ложь) Экспорт
	НаборПрав = Новый Массив;
	
	Если ИмяВидаОбъекта = "Метаданные" Тогда
		НаборПрав = СтрокуВМассив("Администрирование,АдминистрированиеДанных,ОбновлениеКонфигурацииБазыДанных,МонопольныйРежим,АктивныеПользователи,ЖурналРегистрации"
			+ ",ТонкийКлиент,ВебКлиент,ТолстыйКлиент,ВнешнееСоединение,Automation,РежимВсеФункции,СохранениеДанныхПользователя,ИнтерактивноеОткрытиеВнешнихОбработок"
			+ ",ИнтерактивноеОткрытиеВнешнихОтчетов,Вывод"
			+ ?(Платформа8_3, ",АдминистрированиеРасширенийКонфигурации", ""));
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "Подсистемы" Тогда
		НаборПрав.Добавить("Просмотр");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "ПараметрыСеанса" Тогда
		НаборПрав = СтрокуВМассив("Получение,Установка");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "ОбщиеРеквизиты" Тогда
		НаборПрав = СтрокуВМассив("Просмотр,Редактирование");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "ПланыОбмена" Тогда
		НаборПрав = СтрокуВМассив("Чтение,Добавление,Изменение,Удаление,Просмотр,ИнтерактивноеДобавление,Редактирование,ИнтерактивноеУдаление,ИнтерактивнаяПометкаУдаления"
			+ ",ИнтерактивноеСнятиеПометкиУдаления,ИнтерактивноеУдалениеПомеченных,ВводПоСтроке");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "КритерииОтбора" Тогда
		НаборПрав.Добавить("Просмотр");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "ОбщиеФормы" Тогда
		НаборПрав.Добавить("Просмотр");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "ОбщиеКоманды" Тогда
		НаборПрав.Добавить("Просмотр");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "Константы" Тогда
		НаборПрав = СтрокуВМассив("Чтение,Изменение,Просмотр,Редактирование");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "Справочники" Тогда
		НаборПрав = СтрокуВМассив("Чтение,Добавление,Изменение,Удаление,Просмотр,ИнтерактивноеДобавление,Редактирование,ИнтерактивноеУдаление,ИнтерактивнаяПометкаУдаления"
			+ ",ИнтерактивноеСнятиеПометкиУдаления,ИнтерактивноеУдалениеПомеченных,ВводПоСтроке"
			+ ?(Платформа8_3, ",ИнтерактивноеУдалениеПредопределенныхДанных,ИнтерактивнаяПометкаУдаленияПредопределенныхДанных,ИнтерактивноеСнятиеПометкиУдаленияПредопределенныхДанных",""));
			//,ИнтерактивноеУдалениеПомеченныхПредопределенныхДанных "); //Почему то выдает ошибку
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "Документы" Тогда
		НаборПрав = СтрокуВМассив("Чтение,Добавление,Изменение,Удаление,Проведение,ОтменаПроведения,Просмотр,ИнтерактивноеДобавление,Редактирование,ИнтерактивноеУдаление"
			+ ",ИнтерактивнаяПометкаУдаления,ИнтерактивноеСнятиеПометкиУдаления,ИнтерактивноеУдалениеПомеченных,ИнтерактивноеПроведение,ИнтерактивноеПроведениеНеОперативное"
			+ ",ИнтерактивнаяОтменаПроведения,ИнтерактивноеИзменениеПроведенных,ВводПоСтроке");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "ЖурналыДокументов" Тогда
		НаборПрав = СтрокуВМассив("Чтение,Просмотр");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "Отчеты" Тогда
		НаборПрав = СтрокуВМассив("Использование,Просмотр");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "Обработки" Тогда
		НаборПрав = СтрокуВМассив("Использование,Просмотр");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "ПланыВидовХарактеристик" Тогда
		НаборПрав = СтрокуВМассив("Чтение,Добавление,Изменение,Удаление,Просмотр,ИнтерактивноеДобавление,Редактирование,ИнтерактивноеУдаление,ИнтерактивнаяПометкаУдаления"
			+ ",ИнтерактивноеСнятиеПометкиУдаления,ИнтерактивноеУдалениеПомеченных,ВводПоСтроке"
			+ ?(Платформа8_3, ",ИнтерактивноеУдалениеПредопределенныхДанных,ИнтерактивнаяПометкаУдаленияПредопределенныхДанных,ИнтерактивноеСнятиеПометкиУдаленияПредопределенныхДанных",""));//,ИнтерактивноеУдалениеПомеченныхПредопределенныхДанных ");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "ПланыСчетов" Тогда
		НаборПрав = СтрокуВМассив("Чтение,Добавление,Изменение,Удаление,Просмотр,ИнтерактивноеДобавление,Редактирование,ИнтерактивноеУдаление,ИнтерактивнаяПометкаУдаления"
			+ ",ИнтерактивноеСнятиеПометкиУдаления,ИнтерактивноеУдалениеПомеченных,ВводПоСтроке"
			+ ?(Платформа8_3, ",ИнтерактивноеУдалениеПредопределенныхДанных,ИнтерактивнаяПометкаУдаленияПредопределенныхДанных,ИнтерактивноеСнятиеПометкиУдаленияПредопределенныхДанных",""));//,ИнтерактивноеУдалениеПомеченныхПредопределенныхДан");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "ПланыВидовРасчета" Тогда
		НаборПрав = СтрокуВМассив("Чтение,Добавление,Изменение,Удаление,Просмотр,ИнтерактивноеДобавление,Редактирование,ИнтерактивноеУдаление,ИнтерактивнаяПометкаУдаления"
			+ ",ИнтерактивноеСнятиеПометкиУдаления,ИнтерактивноеУдалениеПомеченных,ВводПоСтроке"
			+ ?(Платформа8_3, ",ИнтерактивноеУдалениеПредопределенныхДанных,ИнтерактивнаяПометкаУдаленияПредопределенныхДанных,ИнтерактивноеСнятиеПометкиУдаленияПредопределенныхДанных",""));//,ИнтерактивноеУдалениеПомеченныхПредопределенныхДан");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "РегистрыСведений" Тогда
		НаборПрав = СтрокуВМассив("Чтение,Изменение,Просмотр,Редактирование");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "РегистрыНакопления" Тогда
		НаборПрав = СтрокуВМассив("Чтение,Изменение,Просмотр,Редактирование,УправлениеИтогами");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "РегистрыБухгалтерии" Тогда
		НаборПрав = СтрокуВМассив("Чтение,Изменение,Просмотр,Редактирование,УправлениеИтогами");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "РегистрыРасчета" Тогда
		НаборПрав = СтрокуВМассив("Чтение,Изменение,Просмотр,Редактирование");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "БизнесПроцессы" Тогда
		НаборПрав = СтрокуВМассив("Чтение,Добавление,Изменение,Удаление,Просмотр,ИнтерактивноеДобавление,Редактирование,ИнтерактивноеУдаление,ИнтерактивнаяПометкаУдаления"
			+ ",ИнтерактивноеСнятиеПометкиУдаления,ИнтерактивноеУдалениеПомеченных,ВводПоСтроке,ИнтерактивнаяАктивация,Старт,ИнтерактивныйСтарт");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "Задачи" Тогда
		НаборПрав = СтрокуВМассив("Чтение,Добавление,Изменение,Удаление,Просмотр,ИнтерактивноеДобавление,Редактирование,ИнтерактивноеУдаление,ИнтерактивнаяПометкаУдаления"
			+ ",ИнтерактивноеСнятиеПометкиУдаления,ИнтерактивноеУдалениеПомеченных,ВводПоСтроке,ИнтерактивнаяАктивация,Выполнение,ИнтерактивноеВыполнение");
	КонецЕсли;
	
	Если ИмяВидаОбъекта = "ВнешниеИсточникиДанных" Тогда
		НаборПрав = СтрокуВМассив("Использование,Администрирование,ИзменениеСтандартнойАутентификации,ИзменениеСтандартнойАутентификацииСеанса"
			+ ?(Платформа8_3, ",ИзменениеАутентификацииОССеанса",""));
	КонецЕсли;
	
	Возврат НаборПрав;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтрокуВМассив(знач СтрТекст, знач Разделитель = ",")
	Возврат СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрТекст, Разделитель, Истина, Истина);
КонецФункции

#КонецОбласти
 
 