
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.РежимВыбора Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		ОповеститьОВыборе(ТекущиеДанные.Идентификатор);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МодераторСообщений	= Константы.МодераторСообщенийТехПоддержке.Получить();
	ЭтоМодераторСообщений = (МодераторСообщений = Пользователи.АвторизованныйПользователь());
	МодераторЗаполнен = ЗначениеЗаполнено(МодераторСообщений);
	
	Если МодераторЗаполнен И НЕ ЭтоМодераторСообщений Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма.Список,
			"Отправитель", Пользователи.АвторизованныйПользователь() , ВидСравненияКомпоновкиДанных.Равно,,,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ИначеЕсли НЕ ЭтоМодераторСообщений Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма.Список,
		"Отправитель", Пользователи.АвторизованныйПользователь() , ВидСравненияКомпоновкиДанных.Равно,,,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);		
	КонецЕсли;
	
	//Заменяю код на работу механизма RLS
	//Если НЕ (ЭтоМодераторСообщений Или Пользователи.ЭтоПолноправныйПользователь()) Тогда
	//	Элементы.Список.ИзменятьСоставСтрок = Ложь;
	//КонецЕсли;
	
	Если Параметры.Свойство("ВыборОснования") И Параметры.ВыборОснования Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма.Список,
		"СтатусРазработчика", "", ВидСравненияКомпоновкиДанных.НеРавно,,,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
		
КонецПроцедуры
