
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	КопияОписания = СтандартныеПодсистемыПовтИсп.НовоеОписаниеПодсистемы(); 
	ОписаниеПодсистемы = общегоназначения.СкопироватьРекурсивно(КопияОписания);
	ОбновлениеИнформационнойБазыПТБ.ПриДобавленииПодсистемы(ОписаниеПодсистемы);
	
	//СтрГод = Формат(Год(ТекущаяДата()), "ЧГ=");
	
	Элементы.ДекорацияВерсия.Заголовок = СтрШаблон(Элементы.ДекорацияВерсия.Заголовок, ОписаниеПодсистемы.Версия);
	//Элементы.ДекорацияАвторскиеПрава.Заголовок = СтрШаблон(Элементы.ДекорацияАвторскиеПрава.Заголовок, СтрГод);
	
КонецПроцедуры
