#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ИспользоватьИмя		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИспользоватьИмя", Ложь);
	ИспользоватьСиноним	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИспользоватьСиноним", Ложь);
	РежимОтладки		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "РежимОтладки", Ложь);
	
	СтандартнаяОбработка = НЕ (ИспользоватьИмя ИЛИ ИспользоватьСиноним);
	Если СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = ОбщегоНазначенияПТБ.НастройкиПолученияДанныхВыбора(Параметры, "Справочник.ТестОбработкиВыбора");
	Настройки.ПоискПоНаименованию = Ложь;
	
	Если ИспользоватьИмя Тогда
		Настройки.ПоляПоиска.Добавить("Т.Имя");
	КонецЕсли;
	Если ИспользоватьСиноним Тогда
		Настройки.ПоляПоиска.Добавить("Т.Синоним");
	КонецЕсли;
	
	Настройки.ЗапросПоляВыбора.Добавить("ПРЕДСТАВЛЕНИЕССЫЛКИ(Т.Родитель) КАК Родитель");
	
	Настройки.Представление.Добавить("Наименование");
	Настройки.Представление.Добавить("Родитель");
	
	Настройки.РежимОтладки = РежимОтладки;
	
	ДанныеВыбора = ОбщегоНазначенияПТБ.ПолучитьСписокДанныхВыбора(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
