Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПроведениеСерверПТБ.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСерверПТБ.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// отмена без контроля остатков
	ПроведениеСерверПТБ.ОбработкаУдаленияПроведенияСКонтролем(ЭтотОбъект, Отказ);
	
	//// отмена с контролем остатков
	//ПроведениеСерверПТБ.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры