#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УдаляемыеРеквизиты = Новый Массив;
	
	Если НЕ ЭтотОбъект.СпособРасчета = Перечисления.СпособыРасчетаПоказателяФормулы.Формула Тогда
		УдаляемыеРеквизиты.Добавить("Формула");
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.СпособРасчета = Перечисления.СпособыРасчетаПоказателяФормулы.РучнойВвод Тогда
		УдаляемыеРеквизиты.Добавить("РучноеЗначение");
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.ЭтоПоказатель Тогда
		УдаляемыеРеквизиты.Добавить("ИмяПоказателя");
		УдаляемыеРеквизиты.Добавить("ОписаниеПоказателя");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, УдаляемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли 
