
Функция userPOST(Запрос)
	Возврат ИнтеграцияSlack.ОбработатьSlashКоманду(Запрос);
КонецФункции

Функция componentsPOST(Запрос)
	Возврат ИнтеграцияSlack.ОбработатьComponentsКоманду(Запрос);
КонецФункции



// ТРЕБУЕТ ПРОВЕРКИ

Функция eventsPOST(Запрос)
	ДанныеJSON = Запрос.ПолучитьТелоКакСтроку();
	
	ВременнаяСтруктура = ИнтернетСервисы.ЗначениеИзСтрокиJSON(ДанныеJSON);
	Если НЕ ТипЗнч(ВременнаяСтруктура) = Тип("Структура") Тогда
		Возврат ИнтернетСервисы.ПолучитьОтвет400(НСтр("ru='I don't understand'"));
	КонецЕсли;
	
	Структура = Новый Структура;
	Если ВременнаяСтруктура.type = "event_callback" Тогда
		Структура.Вставить("text", НСтр("ru='Привет, друг'"));
	ИначеЕсли ВременнаяСтруктура.type = "url_verification" Тогда
		Структура.Вставить("challenge", ВременнаяСтруктура.challenge);
	КонецЕсли;
	
	Возврат ИнтернетСервисы.ПолучитьОтвет200(, ИнтернетСервисы.ПолучитьСтрокуJSON(Структура),,);
КонецФункции


