
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)

	СтруктураКлючЗаписи = ПолучитьКлючЗаписиНаСервере(Расшифровка, СтандартнаяОбработка);
	
	Если ЗначениеЗаполнено(СтруктураКлючЗаписи) Тогда
		ОткрытьФорму("РегистрСведений.СообщенияВТехническуюПоддержку.ФормаЗаписи", СтруктураКлючЗаписи);
	КонецЕсли; 

КонецПроцедуры

&НаСервере 
Функция ПолучитьКлючЗаписиНаСервере(Расшифровка, СтандартнаяОбработка)
	
	Данные 	= ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Поля 	= Данные.Элементы.Получить(Расшифровка).ПолучитьПоля();
	
	СтруктураПолей = Новый Структура;
	СтруктураКлючЗаписи = Новый Структура;
	
	Если ТипЗНч(Поля.Найти("Идентификатор")) = Тип("ЗначениеПоляРасшифровкиКомпоновкиДанных") 
		и ТипЗНч(Поля.Найти("Идентификатор")) = Тип("ЗначениеПоляРасшифровкиКомпоновкиДанных") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СтруктураПолей.Вставить("Идентификатор"	, Поля.Найти("Идентификатор").Значение);
		СтруктураПолей.Вставить("Отправитель"	, Поля.Найти("Отправитель").Значение);

		СтруктураКлючЗаписи.Вставить("Ключ", РегистрыСведений.СообщенияВТехническуюПоддержку.СоздатьКлючЗаписи(СтруктураПолей));
	КонецЕсли; 

	Возврат СтруктураКлючЗаписи;
КонецФункции
