
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		ОтображениеСуммыВыделенныхСтрок = Новый Соответствие; // Соответствие Элементов ТаблицаФормы (для которой вычисляем суммы) и ГруппаФормы(в которой создаем реквизиты расчета) 
	ОтображениеСуммыВыделенныхСтрок.Вставить("Список"			, "Группа1");

	ГрупповоеРедактированиеТабличныхЧастейСервер.СформироватьОписаниеТабличныхЧастейФормы(ЭтаФорма,,,,ОтображениеСуммыВыделенныхСтрок);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасчетСуммыВыделенныхСтрок() Экспорт
	ГрупповоеРедактированиеТабличныхЧастейКлиент.РасчетСуммыВыделенныхСтрок(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)
	ЭтотОбъект.ПодключитьОбработчикОжидания("Подключаемый_РасчетСуммыВыделенныхСтрок", 0.2, Истина);
КонецПроцедуры
