
#Область ПрограммныйИнтерфейс

// Выполняет обновление строки представления настройки отбора
//
// Параметры:
//	Форма 					- УправляемаяФорма
//	ИмяРеквизитаКомпоновщик	- Строка - имя реквизита с типом КомпоновщикНастроекКомпоновкиДанных
//	ПустоеЗначение			- Строка - представление строки если настройка отбора не задана.
//		По умолчанию "Нажмите для настройки отбора"
// 
Процедура ОбновитьПредставлениеОтбора(Форма, знач ИмяРеквизитаКомпоновщик, знач ПустоеЗначение = "") Экспорт 
	Если ПустаяСтрока(ПустоеЗначение) Тогда
		ПустоеЗначение = НСтр("ru='Нажмите для настройки отбора...'");
	КонецЕсли;
	
	ПредставлениеОтбора = Строка(Форма[ИмяРеквизитаКомпоновщик].Настройки.Отбор);
	Форма[ИмяРеквизитаКомпоновщик + "НастройкиОтборПредставление"] = ?(ПустаяСтрока(ПредставлениеОтбора),
		ПустоеЗначение,
		ПредставлениеОтбора);
КонецПроцедуры
	
#КонецОбласти
