////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ МОДУЛЯ
 
Процедура ПередЗаписью(Отказ, Замещение)
	
	СтатусыСообщений = Перечисления.СтатусыСообщенийВТехническуюПоддержку;
	
	Для Каждого ЗаписьРегистра Из ЭтотОбъект Цикл
		Если ЗаписьРегистра.Статус = СтатусыСообщений.Новое Тогда
			Если НЕ ЗаписьРегистра.ДатаОтправки = Дата(1,1,1) Тогда
				ЗаписьРегистра.Статус	= СтатусыСообщений.Отправлено;
			ИначеЕсли ЗаписьРегистра.Согласовано И ЗаписьРегистра.Отклонено Тогда
				ЗаписьРегистра.Статус	= СтатусыСообщений.ОтклоненоМодератором;
			КонецЕсли;
		ИначеЕсли ЗаписьРегистра.Статус = СтатусыСообщений.ОшибкаОтправки Тогда
			//ЗаписьРегистра.ДатаОтправки = Дата(1,1,1);
		Иначе 
			Если ЗаписьРегистра.СтатусРазработчика = "Отклонено" Тогда
				ЗаписьРегистра.Статус	= СтатусыСообщений.ОтклоненоРазработчиком;
			ИначеЕсли ЗаписьРегистра.СтатусРазработчика = "Завершено" Тогда
				ЗаписьРегистра.Статус	= СтатусыСообщений.Выполнено;
			ИначеЕсли ЗаписьРегистра.СтатусРазработчика = "Принято" ИЛИ ЗаписьРегистра.СтатусРазработчика = "" Тогда
				ЗаписьРегистра.Статус	= СтатусыСообщений.Отправлено;
			Иначе
				ЗаписьРегистра.Статус	= СтатусыСообщений.ПринятоКИсполнению;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗаписьРегистра.Статус = СтатусыСообщений.ПринятоКИсполнению Тогда
			Файлы = ЗаписьРегистра.Файлы.Получить();
			Если Файлы <> Неопределено Тогда
				Для Каждого СтруктураДанных Из Файлы Цикл
					СтруктураДанных.ДвоичныеДанные = Неопределено;
				КонецЦикла;
				ЗаписьРегистра.Файлы = Новый ХранилищеЗначения(Файлы);	
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьРегистра = ЭтотОбъект[0];
	ЗаписьРегистра.Идентификатор	= Строка(Новый УникальныйИдентификатор);
	ЗаписьРегистра.Отправитель		= Пользователи.ТекущийПользователь();
	ЗаписьРегистра.Важность			= "Обычная";
	ЗаписьРегистра.Вид				= Перечисления.ВидыСообщенийВТехническуюПоддержку.Доработка;
	ЗаписьРегистра.ДатаОтправки		= Дата(1, 1, 1);
	ЗаписьРегистра.ДатаСогласования	= Дата(1, 1, 1);
	ЗаписьРегистра.ДатаСоздания		= ТекущаяДатаСеанса();
	ЗаписьРегистра.Согласовано		= Ложь;
	ЗаписьРегистра.Отклонено		= Ложь;
	ЗаписьРегистра.Статус			= Перечисления.СтатусыСообщенийВТехническуюПоддержку.Новое;
	ЗаписьРегистра.КодРазработчика	= 0;
	Если ДанныеЗаполнения <> Неопределено Тогда
		ЗаписьРегистра.Текст = ?(ДанныеЗаполнения.Свойство("ПараметрСсылка"),ДанныеЗаполнения.ПараметрСсылка,"");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Вставить содержимое обработчика.
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
